xsim_AB_360/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    0;
    object      U;
}
dimensions [0 1 -1 0 0 0 0];
internalField uniform (0.219 0.0 0.0);
boundaryField
{
    channel_AB_2-wall
    {
        type fixedValue;
        value uniform (0 0 0);
    }
    channel_AB_2-outlet
    {
        type zeroGradient;
    }
    channel_AB_2-inlet
    {
        type fixedValue;
        value uniform (0.219 0 0);
    }
}
