xsim_AB_360/0/epsilon
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    0;
    object      epsilon;
}
dimensions [0 2 -3 0 0 0 0];
internalField uniform 0.001;
boundaryField
{
    channel_AB_2-wall
    {
        type epsilonWallFunction;
        value uniform 0.0;
    }
    channel_AB_2-outlet
    {
        type zeroGradient;
    }
    channel_AB_2-inlet
    {
        type fixedValue;
        value uniform 0.01;
    }
}
