xsim_AB_360/0/k
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    0;
    object      k;
}
dimensions [0 2 -2 0 0 0 0];
internalField uniform 0.001;
boundaryField
{
    channel_AB_2-wall
    {
        type kqRWallFunction;
        value uniform 0.0;
    }
    channel_AB_2-outlet
    {
        type zeroGradient;
    }
    channel_AB_2-inlet
    {
        type fixedValue;
        value uniform 0.001;
    }
}
