xsim_AB_360/0/nut
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    0;
    object      nut;
}
dimensions [0 2 -1 0 0 0 0];
internalField uniform 0.001;
boundaryField
{
    channel_AB_2-wall
    {
        type nutkWallFunction;
        value uniform 0.0;
    }
    channel_AB_2-outlet
    {
        type calculated;
        value uniform 0.001;
    }
    channel_AB_2-inlet
    {
        type calculated;
        value uniform 0.001;
    }
}
