xsim_AB_360/0/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    0;
    object      p;
}
dimensions [0 2 -2 0 0 0 0];
internalField uniform 0.0;
boundaryField
{
    channel_AB_2-wall
    {
        type zeroGradient;
    }
    channel_AB_2-outlet
    {
        type fixedValue;
        value uniform 0.0;
    }
    channel_AB_2-inlet
    {
        type zeroGradient;
    }
}
