xsim_AB_360/constant/transportProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
transportModel  Newtonian;
nu  nu [0 2 -1 0 0 0 0] 3.16e-06;
