xsim_AB_360/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
vertices
(
  (-0.0022 -0.0132 -0.0132)
  (0.2222 -0.0132 -0.0132)
  (0.2222 0.0132 -0.0132)
  (-0.0022 0.0132 -0.0132)
  (-0.0022 -0.0132 0.0132)
  (0.2222 -0.0132 0.0132)
  (0.2222 0.0132 0.0132)
  (-0.0022 0.0132 0.0132)
);
blocks
(
  hex (0 1 2 3 4 5 6 7) (180 22 22) simpleGrading (1 1 1)
);
edges ();
patches ();
mergePatchPairs ();
