xsim_AB_360/system/snappyHexMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      snappyHexMeshDict;
}
castellatedMesh true;
snap            true;
addLayers       true;
geometry
{
  channel_AB_2-inlet.stl
  {
    type triSurfaceMesh;
    name channel_AB_2-inlet;
    regions
    {
      channel_AB_2-inlet
      {
        name channel_AB_2-inlet;
      }
    }
  }
  channel_AB_2-outlet.stl
  {
    type triSurfaceMesh;
    name channel_AB_2-outlet;
    regions
    {
      channel_AB_2-outlet
      {
        name channel_AB_2-outlet;
      }
    }
  }
  channel_AB_2-wall.stl
  {
    type triSurfaceMesh;
    name channel_AB_2-wall;
    regions
    {
      channel_AB_2-wall
      {
        name channel_AB_2-wall;
      }
    }
  }
  box0
  {
    type searchableBox;
    // Error epsilon is added/subtracted for stability.
    min (0.014999999 -0.012000001 -0.012000001);
    max (0.070000001 0.012000001 0.012000001);
  }
}
castellatedMeshControls
{
  features (
    {
      file "channel_AB_2-inlet.eMesh";
      level 1;
    }
    {
      file "channel_AB_2-outlet.eMesh";
      level 1;
    }
    {
      file "channel_AB_2-wall.eMesh";
      level 1;
    }
  );
  refinementSurfaces
  {
    channel_AB_2-inlet
    {
      level (0 0);
      regions
      {
        channel_AB_2-inlet
        {
          level (0 0);
          patchInfo
          {
            type patch;
          }
        }
      }
    }
    channel_AB_2-outlet
    {
      level (0 0);
      regions
      {
        channel_AB_2-outlet
        {
          level (0 0);
          patchInfo
          {
            type patch;
          }
        }
      }
    }
    channel_AB_2-wall
    {
      level (0 0);
      regions
      {
        channel_AB_2-wall
        {
          level (0 0);
          patchInfo
          {
            type wall;
          }
        }
      }
    }
  }
  refinementRegions
  {
    box0
    {
      mode inside;
      levels ((2 2));
    }
  }
  locationInMesh (0.11 0.0 0.0);
  maxLocalCells 100000000;
  maxGlobalCells 100000000;
  minRefinementCells 1;
  nCellsBetweenLevels 7;
  resolveFeatureAngle 30;
  allowFreeStandingZoneFaces false;
}
snapControls
{
  nSolveIter 30;
  nSmoothPatch 3;
  tolerance 4.0;
  nRelaxIter 5;
  nFeatureSnapIter 10;
}
addLayersControls
{
  layers
  {
  channel_AB_2-wall
  {
    nSurfaceLayers 3;
  }
  }
  relativeSizes true;
  expansionRatio 1.0;
  finalLayerThickness 0.3;
  minThickness 0.03;
  nGrow 1;
  featureAngle 60;
  nRelaxIter 5;
  nSmoothSurfaceNormals 1;
  nSmoothNormals 3;
  nSmoothThickness 10;
  maxFaceThicknessRatio 0.5;
  maxThicknessToMedialRatio 0.3;
  minMedianAxisAngle 130;
  nBufferCellsNoExtrude 0;
  nLayerIter 50;
  nRelaxedIter 20;
}
meshQualityControls
{
  maxNonOrtho 65;
  maxBoundarySkewness 20;
  maxInternalSkewness 4;
  maxConcave 80;
  minFlatness 0.5;
  minVol 1.00E-13;
  minTetQuality -1e30;
  minArea -1;
  minTwist 0.05;
  minDeterminant 0.001;
  minFaceWeight 0.05;
  minVolRatio 0.01;
  minTriangleTwist -1;
  nSmoothScale 4;
  errorReduction 0.75;
  relaxed
  {
    maxNonOrtho 180;
  }
}
debug 0;
mergeTolerance 1e-5;
