xsim_AB_360/system/surfaceFeaturesDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      surfaceFeaturesDict;
}
surfaces
(
    "channel_AB_2-inlet.stl"
    "channel_AB_2-outlet.stl"
    "channel_AB_2-wall.stl"
);
includedAngle 165.0
subsetFeatures
{
    nonManifoldEdges no;
    openEdges yes;
}
writeObj yes;
